<HTML>
	<HEAD>
		<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=big5">
		<TITLE>取得執行 INSERT 陳述式時，被影響的記錄數目。</TITLE>
	</HEAD>
	<BODY>
<?php
 ///////////////////////////////////////////////////////////////////////////////////////////////////////////
//              連結(登入) MYSQL 資料庫系統
////////////////////////////////////////////////////////////////////////////////////////////////////////////
            $link = mysqli_connect("localhost", "root");
			if (!$link)
			{
				die("無法建立連接<BR><BR>" . mysql_error());
			}
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
//     設定 匯入資料庫檔案名稱 並 讀取資料
//////////////////////////////////////////////////////////////////////////////////////////////////////////////	
			       $dbn1=$_POST["tran"];
                   $dbna=$dbn1.".sql";             //設定檔名
                   $teop=file($dbna);            //讀取資料
//////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//    除去檔案標頭設定(3 byte)  
//    資料庫名稱第一字必須為英文字母,且名稱中不可有中文字
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////

        $tad1=$teop[0];                   //讀取第一列資料
 
       $tarr=str_split($tad1);                //分割字串成陣列
       $a=count($tarr);
       $ptn1="[a-z,A-Z,0-9]{1}";            //設定資料判斷格式
       $afin="";                          //$afin為資料庫名稱存放變數
       for($b=0;$b<$a;$b++)
       {
          if(@ereg($ptn1,$tarr[$b]))           //擷取正確的資料庫名稱
          {
              $afin=$afin.$tarr[$b];
          }
       }
                            

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

           $a=count($teop);

           $tatak=$afin;              //資料庫名稱置入 $tatak 變數中
 
            mysqli_query($link, "SET NAMES UTF8");
            $sql="create database ".$tatak;
            $result = mysqli_query($link, $sql);             //建立資料庫 
               
$db_selected = mysqli_select_db($link, $tatak);         //開啟資料庫
            if (!$db_selected)
			{
   		 	   die("無法開啟 ".$tatak." 資料庫<BR>" . mysql_error($link));
			}

         $sql2="";
            $ty=0;
            for($i=1;$i<$a;$i++)           //從第二列開始執行資料匯入指令
            {
               if($teop[$i]!="")
               {
                  $sql2 =  $teop[$i];
                  $result = mysqli_query($link, $sql2); 
               }
            }
             mysqli_close($link);
             echo $dbna."資料匯入完畢";
?> 
	</BODY>
</HTML>
