<?php
//////////////////////重新定義 ereg 與 eregi 函數 ////////////////////////////////////////
if (!function_exists('ereg'))
{
    function ereg($pattern, $string, $regs)
    {
        return preg_match('/'.$pattern.'/', $string, $regs);
    }
}
 
if (!function_exists('eregi'))
{
    function eregi($pattern, $string, $regs)
    {
        return preg_match('/'.$pattern.'/i', $string, $regs);
    }
}
/////////////////////////////////////////////////////////////////////////////////////////
  $message="身分證號碼正確";
  $idnu=$_POST["idnu"];
//驗證字軌、性別及數字資料型態
//定義驗證樣式(首碼為英文、2碼為[1,2]、其餘為數字)
 
   $ptn1="[a-z]{1}[1-2]{1}[0-9]{8}";

//驗證是否符合 $ptn1 規則

//////////////  本法為配合  自訂ereg 函數    ///////////////////////
/*
   $ans="";
   if(ereg($ptn1,$idnu,$ans))
   {
     $message="身分證號碼錯誤";
   }
*/
//////////////  本法為直接使用  preg_match 函數    //////////////////////

   if(preg_match('/'.$ptn1.'/',$idnu))
   {
     $message="身分證號碼錯誤";
   }

////////////////////////////////////////////////////////////////////
//驗證資料是否符合運算法則
//字串資料分割

   $ch=str_split($idnu,1);

// $cityna[ ]陣列用來設定各縣市的英文字軌

    $cityna=array(10=>"A",11=>"B",12=>"C",13=>"D",14=>"E",15=>"F",16=>"G",17=>"H",18=>"J",19=>"K",20=>"L",21=>"M",22=>"N",23=>"P",24=>"Q",25=>"R",26=>"S",27=>"T",28=>"U",29=>"V",30=>"X",31=>"Y",32=>"W",33=>"Z",34=>"I",35=>"O");

//將陣列資料的索引和資料對調

    $cityna1=array_flip($cityna);

//運算資料數字和
      $nu=0;
 //英文字軌運算
      $nu=$nu+((int)($cityna1[$ch[0]]/10)+($cityna1[$ch[0]]%10)*9); 

 //2~9位置數字運算

      for($i=1;$i<=8;$i++)
      {
       $nu=$nu+$ch[$i]*(9-$i);
      }

 //尾數運算
       $nu=$nu+$ch[9];

 //判斷總合數字是否為10的倍數

       if(($nu%10)!=0)
       {
          $message="身分證號碼錯誤";
       }

echo "你輸入的身分證碼為:".$idnu."<br>";
echo "驗證結果:   ".$message;

?>
