<?php
////////////////////////////////////////////////////////////////////////////////////
//
//                      商品報價查詢系統
//
////////////////////////////////////////////////////////////////////////////////////
//
//                      登錄 mysql 資料庫系統
//                     
//                      開啟 product 資料庫
//
//                      讀取 price 資料表中之資料
//
/////////////////////////////////////////////////////////////////////////////////////
//程式碼
/////////////////////////////////////////////////////////////////////////////////////

             $link = mysqli_connect("localhost", "root");    //登入 mysql 資料庫系統
		$db_selected = mysqli_select_db($link, "product" );     //開啟  product 資料庫
   mysqli_query($link,"SET NAMES utf8");                                     //設定 中文資料為 utf8編碼
             $sql = "SELECT * FROM PRICE";                            //設定查詢資料條件
             $result = mysqli_query($link, $sql );                      //讀取資料

/////////////////////////////////////////////////////////////////////////////////////
//
//                      擷取查詢條件資料
//  條件項目:公司名稱、產品項目、價格區間
//  執行方法:1.先將 公司名稱 置入 $cona[ ]    陣列變數中
//                  產品項目 置入 $proitem[ ] 陣列變數中
//                  設定價格區間  起價 $lopa  迄價 $hipa
//           2.釋放 price 資料表之資料所佔用的空間 並 関閉資料庫
//           3.篩選 公司名稱 及 產品項目
//
//////////////////////////////////////////////////////////////////////////////////////
//     方法 1.
//程式碼
/////////////////////////////////////////////////////////////////////////////////////

                      $lopa=20000;                 //設定最低價初值
                      $hipa=0;                     //設定最高價初值
                      while ($row = mysqli_fetch_array($result, MYSQL_BOTH))          //置換資料廻圈
			{
                            $cona[]=$row["brand"];             //公司名稱置入 $co_na 陣列中
                            $proitem[]=$row["category"];       //產品項目置入 $pro_item 陣列中
                            if($row["price"]<$lopa)             //設定 起價 價格
                            {
                              $lopa=$row["price"];
                            }
                            if($row["price"]>$hipa)             //設定 迄價價格
                            {
                              $hipa=$row["price"];
                            }
                            			
			}
  
////////////////////////////////////////////////////////////////////////////////
//    方法2.釋放佔用記體空間並登出資料庫
////////////////////////////////////////////////////////////////////////////////
//程式碼
/////////////////////////////////////////////////////////////////////////////////////

			mysqli_free_result($result);
			mysqli_close($link);

///////////////////////////////////////////////////////////////////////////////
//    方法3.篩選 公司名稱 及 產品項目
//          設定 $co_na[ ]     為篩選後之公司名稱陣列
//               $pro_item[ ]  為篩選後之產品項目陣列   
// 
//    定義 篩選函數的處理步驟
//         1.先將陣列資料排序
//         2.設定 $arch[ ]為篩選後的陣列變數
//         3.設定 $ck 為篩選陣列索引初值
//         4.$arch[$ck]=$cona[0]              //第一筆資料必定不會重覆 
//         5.廻圈從第二筆資料開始執行
//             如果 $cona[ ]的資料 與 $arch[$ck]的資料值不同(表示為新資料)
//             將 $ck 值加1,再將 $cona[$a] 的值置入 $arch[$ck]中
//         6.廻圈執行完成回傳 $arch 陣列資料
//
/////////////////////////////////////////////////////////////////////////////////
//程式碼
/////////////////////////////////////////////////////////////////////////////////////

     function arrcheck($arr)                   // 定義篩選函數
     {              
       sort($arr);                             // 排序傳遞的陣列資料
       $ck=0;                                  // 進行篩選,設定初值
       $arch[$ck]=$arr[0];                     // 第一筆資料不會重覆
       for($a=1;$a<count($arr);$a++)           // 廻圈資料從第二筆開始篩選
       {                              
          if($arr[$a]!=$arch[$ck])             // 如果 $arr[$a]的資料 與 $arch[$ck]的資料值不同
          {                                    //   (表示為新資料)
              $ck++;                           // $arch陣列的索引值加1(要置入新資料)
              $arch[$ck]=$arr[$a];              // 置入新資料
          }
       }
       return $arch;                           //篩選完成,回傳篩選資料
     }

///////////////////////////////////////////////////////////////////////////////////
//        執行 資料篩選
//////////////////////////////////////////////////////////////////////////////////
//程式碼
/////////////////////////////////////////////////////////////////////////////////////

          $co_na=arrcheck($cona);             //呼叫篩選函數 篩選公司名稱 資料
          $pro_item=arrcheck($proitem);       //呼叫篩選函數 產品項目 資料 

////////////////////////////////////////////////////////////////////////////////////
//
//        進行表單列印設定: 傳送方式:post  後台處理程式:pro_select_tab.php
//                          公司表單名稱:    cona     (下拉式表單)
//                          產品項目表單名稱:proitem  (下拉式表單)
//                          價格表單名稱: 起價:lopa  迄價:hipa                         
//
///////////////////////////////////////////////////////////////////////////////////
//程式碼
/////////////////////////////////////////////////////////////////////////////////////

   echo "<table align='center'><tr><td>";
   echo "<form method='post' action='pro_select_tab.php'>";        //表單條件設定
   echo "<h1>中新公司產品報價系統</h1>";
   echo "請輸入設定條件:<p>";
   echo "公司:<select name='cona' size='1'>";                      //公司下拉式表單設定
        echo "<option value='全部'>全部</option>";
      for($a=0;$a<count($co_na);$a++)
      {
        echo "<option value='".$co_na[$a]."'>".$co_na[$a]."</option>";
      }
   echo "</select><p>";

      echo "產品:<select name='proitem' size='1'>";                //產品下拉式表單設定
        echo "<option value='全部'>全部</option>";
      for($a=0;$a<count($pro_item);$a++)
      {
        echo "<option value='".$pro_item[$a]."'>".$pro_item[$a]."</option>";
      }
   echo "</select><p>";

   echo "價格: 自<input type='text' name='lopa' value='".$lopa."'>";   //價格文字表單設定
   echo "  到<input type='text' name='hipa' value='".$hipa."'><p>";

   echo "<input type='submit' name='submit' value='送出'>　";
   echo "<input type='reset' name='reset' value='重填'>　";
   echo "</form>";
   echo "</td></tr></table>";









?>
   
             


























