<?php
   //設定國字金額位置陣列(百、千、萬、億、兆、京、垓 、杼、穰、溝、澗、正、載、極、恆河沙、阿僧ㄩ、那由它、不可思議、無量、大數)

$amount=array("元","拾","佰","仟","萬","拾","佰","仟","億","拾","佰","仟","兆","拾","佰","仟","京","拾","佰","仟");    //單位，由後往前

   //設定數字國字轉換陣列

$nachar=array("零","壹","貳","參","肆","伍","陸","柒","捌","玖");    //數字，由前往後

//接收資料
$source=$_POST["ntdo"];

//分割$source字串
$dato=str_split($source);

//進行資料轉換(數字轉國字)
$lon=count($dato);

//第1種格式
$ans1="";
for($x=0;$x<$lon;$x++)
{
  $ans1=$ans1.$nachar[$dato[$x]].$amount[$lon-1-$x];
}

//列印結果報表
echo "您輸入的金額數字為：".$source."<br>";
echo "轉換國字金額為：".$ans1."<br>";

?>