<?php
///////////    接收資料(輸入)   //////////////////////////////////////////////////
  For($x=0;$x<=4;$x++)
  {
    $name="data".$x;
    $data[$x]=$_POST[$name];    //$data[$x]=$_POST["data".$x]  (看版本)
  }

///////////    計算總分及平均 (資料處理)     /////////////////////////////////
  For($x=1;$x<=4;$x++)
  {
    @$data[5]+=$data[$x];   
    //php規定所有被用來計算的變數，都要設定初值(看版本)，否則會出現
    // notice 訊息，在指令前面加上@符號，即可避免 notice 訊息 的顯示
  }
    $data[6]=(int)( $data[5]/4+0.5);    //平均為 四拾五入 取整數

///////////    列印報表 (輸出)     /////////////////////////////////

  Echo "<table border='1'>";
    //////  第一列(標題列)  //////////////////////////////////////
     $tit=array("座號", "姓名", "國文", "英文", "數學", "化學","總分","平均");
     Echo "<tr align='center'>";
     For($x=0;$x<=7;$x++)
     {
        Echo "<td>".$tit[$x]."</td>";
     }
     Echo "</tr>";
    //////  第二列(資料列)  //////////////////////////////////////
  Echo  "<tr align='center'><td width='80'>1</td>";
  For($x=0;$x<=6;$x++)
  {
    Echo "<td width='80'> " .$data[$x]."</td> ";
  }
   Echo "</tr></table>";
?>
