<?php
include("cl2048.inc");
///////////////////////////////////////////////////////////////////////////
//
//                   2048遊戲
//
///////////////////////////////////////////////////////////////////////////

//設定一個4*4的空白陣列

for($x=1;$x<=4;$x++)
{
   for($y=1;$y<=4;$y++)
   {
       $a[$x][$y]=0;
   }
}

//設定陣列位置值分別為    1   2   3   4
//                        5   6   7   8
//                        9  10  11  12
//                       13  14  15  16
//  所以 位置值對應陣列索引座標為  ($x-1)*4+$y
//

//設定陣列空值位置陣列

  for($p=1;$p<=16;$p++)
  {
     $emptyarr[$p]=$p;
  }

//隨機抽取兩個位置置資料

  for($se=16;$se>=15;$se--)
  {
    $k=rand(1,$se);                //隨機抽取一個位置

    $y=($emptyarr[$k]%4);          //計算選取位置的 $y 索引值
    if($y==0)                           //修正$y值
    {
      $y=4;
    }
    $x=(int)(($emptyarr[$k]-$y)/4)+1;   //計算選取位置的 $x 索引值

    $a[$x][$y]=2;                  //變更選取位置的陣列資料值
    $emptyarr[$k]=$emptyarr[$se];  //將最後一個位置資料值移到已被選取的位置中
  }

//列印2048初始畫面
   //定義函數
   fu2048($a);

//傳送表單設定

   form2048($a);
   echo "</center>";
?>