<?php
//讀取基本資料,並指定給相對應的變數

$y=$_POST["yea"];                 //$y 為西元年份

//判斷閏年或平年

if((($y%400)==0)or((($y%100)<>0)and(($y%4)==0)))
{
 echo "西元".$y."是閏年<br>";
}
else
{
 echo "西元".$y."不是閏年<br>";
}


//計算閏、平年數
$n4=(int)(($y-1)/4);
$n100=(int)(($y-1)/100);
$n400=(int)(($y-1)/400);
$ns=$n4-$n100+$n400;      //計算閏年數
$nl=($y-1)-$ns;             //計算平年數
$w=($ns+$y)%7;
echo "從西元元年至 ".($y-1)." 年,共有:<br>";
echo "閏年數: ".$ns." 個<br>";
echo "平年數: ".$nl." 個<br>";
if($w==0)
{
   echo "西元　".$y."　年元旦為　星期日";
}
else
{
   echo "西元　".$y."　年元旦為　星期".$w;
}
?>